music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" LIMIT $1  [["LIMIT", 1]]
---
    def new
        @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "is_live?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Post"], ["year", 1995], ["band_id", 2], ["is_live?", false], ["created_at", "2019-01-31 23:15:05.943974"], ["updated_at", "2019-01-31 23:15:05.943974"]]
---
    def create
        album = Album.new(album_params)
        band = Band.find_by(params[:band_id])
        if album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Funerals"], ["updated_at", "2019-01-31 22:46:25.028135"], ["id", 1]]
---
    def update
        album = Album.find(params[:id])
        if album.update_attributes!(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
    def destroy
        album = Album.find(params[:id])
        album.destroy