music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]